arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/lpuart/fsl_lpuart_hal.c
    return LPUART_STAT_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetBitCountPerChar
 * Description   : Configures the number of bits per char in LPUART controller.
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetBitCountPerChar(LPUART_Type * base,
                                   lpuart_bit_count_per_char_t bitCountPerChar)
{
    if (bitCountPerChar == LPUART_10_BITS_PER_CHAR)
    {
        BITBAND_ACCESS32(&(base->BAUD), LPUART_BAUD_M10_SHIFT) = (uint32_t)1U;
    }
    else
    {
        /* config 8-bit (M=0) or 9-bits (M=1) */
        BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_M_SHIFT) = (uint32_t)bitCountPerChar;
        /* clear M10 to make sure not 10-bit mode */
        BITBAND_ACCESS32(&(base->BAUD), LPUART_BAUD_M10_SHIFT) = (uint32_t)0U;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetParityMode
 * Description   : Configures parity mode in the LPUART controller.
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetParityMode(LPUART_Type * base, lpuart_parity_mode_t parityModeType)
{
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_PE_SHIFT) = (uint32_t)(parityModeType >> 1U);
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_PT_SHIFT) = (uint32_t)(parityModeType & 1U);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Putchar9
 * Description   : Sends the LPUART 9-bit character.
 *
 *END**************************************************************************/
void LPUART_HAL_Putchar9(LPUART_Type * base, uint16_t data)
{
    uint8_t ninthDataBit;
    uint8_t * dataRegBytes = (uint8_t *)(&(base->DATA));
    

    ninthDataBit = (data >> 8U) & 0x1U;

    /* write to ninth data bit T8(where T[0:7]=8-bits, T8=9th bit) */
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_R9T8_SHIFT) = (uint32_t)ninthDataBit;

    /* write 8-bits to the data register*/
    dataRegBytes[0] = data;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Putchar10
 * Description   : Sends the LPUART 10-bit character.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_Putchar10(LPUART_Type * base, uint16_t data)
{
    uint8_t ninthDataBit, tenthDataBit;
    uint8_t * dataRegBytes = (uint8_t *)(&(base->DATA));

    ninthDataBit = (data >> 8U) & 0x1U;
    tenthDataBit = (data >> 9U) & 0x1U;

    /* write to ninth/tenth data bit (T[0:7]=8-bits, T8=9th bit, T9=10th bit) */
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_R9T8_SHIFT) = (uint32_t)ninthDataBit;
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_R8T9_SHIFT) = (uint32_t)tenthDataBit;

    /* write to 8-bits to the data register */
    dataRegBytes[0] = data;

    return LPUART_STAT_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Getchar9
 * Description   : Gets the LPUART 9-bit character.
 *
 *END**************************************************************************/
void LPUART_HAL_Getchar9(LPUART_Type * base, uint16_t *readData)
{
    /* get ninth bit from lpuart data register */
    *readData = (uint16_t)(BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_R8T9_SHIFT) << 8);

    /* get 8-bit data from the lpuart data register */
    *readData |= (uint8_t)base->DATA;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_Getchar10
 * Description   : Gets the LPUART 10-bit character, available only on
 *                 supported lpuarts
 *
 *END**************************************************************************/
void LPUART_HAL_Getchar10(LPUART_Type * base, uint16_t *readData)
{
    /* read tenth data bit */
    *readData = (uint16_t)((uint32_t)(BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_R9T8_SHIFT)) << 9U);

    /* read ninth data bit */
    *readData |= (uint16_t)((uint32_t)(BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_R8T9_SHIFT)) << 8U);

    /* get 8-bit data */
    *readData |= (uint8_t)base->DATA;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SendDataPolling
 * Description   : Send out multiple bytes of data using polling method.
 * This function only supports 8-bit transaction.
 *
 *END**************************************************************************/
void LPUART_HAL_SendDataPolling(LPUART_Type * base,
                                const uint8_t *txBuff,
                                uint32_t txSize)
{
    while (txSize--)
    {
        while (!BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_TDRE_SHIFT))
        {}

        LPUART_HAL_Putchar(base, *txBuff++);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_ReceiveDataPolling
 * Description   : Receive multiple bytes of data using polling method.
 * This function only supports 8-bit transaction.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_ReceiveDataPolling(LPUART_Type * base,
                                              uint8_t *rxBuff,
                                              uint32_t rxSize)
{
    lpuart_status_t retVal = LPUART_STAT_SUCCESS;

    while (rxSize--)
    {
        while (!BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_RDRF_SHIFT))
        {}

        LPUART_HAL_Getchar(base, rxBuff++);

