arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/lpuart/fsl_lpuart_hal.c
        /* Clear the Overrun flag since it will block receiving */
        if (BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_OR_SHIFT))
        {
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_OR_SHIFT) = (uint32_t)1U;
            retVal = LPUART_STAT_RX_OVERRUN;
        }
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetIntMode
 * Description   : Configures the LPUART module interrupts to enable/disable
 * various interrupt sources.
 *
 *END**************************************************************************/
void LPUART_HAL_SetIntMode(LPUART_Type * base, lpuart_interrupt_t intSrc, bool enable)
{
    uint32_t reg = (uint32_t)(intSrc) >> LPUART_SHIFT;
    uint32_t intRegOffset = (uint16_t)(intSrc);

    switch ( reg )
    {
        case LPUART_BAUD_REG_ID:
            BITBAND_ACCESS32(&(base->BAUD), intRegOffset) = (uint32_t)enable;
            break;
        case LPUART_STAT_REG_ID:
            BITBAND_ACCESS32(&(base->STAT), intRegOffset) = (uint32_t)enable;
            break;
        case LPUART_CTRL_REG_ID:
            BITBAND_ACCESS32(&(base->CTRL), intRegOffset) = (uint32_t)enable;
            break;
        case LPUART_DATA_REG_ID:
            BITBAND_ACCESS32(&(base->DATA), intRegOffset) = (uint32_t)enable;
            break;
        case LPUART_MATCH_REG_ID:
            BITBAND_ACCESS32(&(base->MATCH), intRegOffset) = (uint32_t)enable;
            break;
#if FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
        case LPUART_MODIR_REG_ID:
            BITBAND_ACCESS32(&(base->MODIR), intRegOffset) = (uint32_t)enable;
            break;
#endif
#if FSL_FEATURE_LPUART_FIFO_SIZE
        case LPUART_FIFO_REG_ID:
            BITBAND_ACCESS32(&(base->FIFO), intRegOffset) = (uint32_t)enable;
            break;
#endif
        default :
            break;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_GetIntMode
 * Description   : Returns whether LPUART module interrupt is enabled/disabled.
 *
 *END**************************************************************************/
bool LPUART_HAL_GetIntMode(LPUART_Type * base, lpuart_interrupt_t intSrc)
{
    uint32_t reg = (uint32_t)(intSrc) >> LPUART_SHIFT;
    bool retVal = false;

    switch ( reg )
    {
        case LPUART_BAUD_REG_ID:
            retVal = (bool)(base->BAUD >> (uint16_t)(intSrc) & 1U);
            break;
        case LPUART_STAT_REG_ID:
            retVal = (bool)(base->STAT >> (uint16_t)(intSrc) & 1U);
            break;
        case LPUART_CTRL_REG_ID:
            retVal = (bool)(base->CTRL >> (uint16_t)(intSrc) & 1U);
            break;
        case LPUART_DATA_REG_ID:
            retVal = (bool)(base->DATA >> (uint16_t)(intSrc) & 1U);
            break;
        case LPUART_MATCH_REG_ID:
            retVal = (bool)(base->MATCH >> (uint16_t)(intSrc) & 1U);
            break;
#if FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
        case LPUART_MODIR_REG_ID:
            retVal = (bool)(base->MODIR >> (uint16_t)(intSrc) & 1U);
            break;
#endif
        default :
            break;
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetLoopbackCmd
 * Description   : Configures the LPUART loopback operation (enable/disable
 *                 loopback operation)
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetLoopbackCmd(LPUART_Type * base, bool enable)
{
    /* configure LOOPS bit to enable(1)/disable(0) loopback mode, but also need
     * to clear RSRC */
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_LOOPS_SHIFT) = (uint32_t)enable;

    /* clear RSRC for loopback mode, and if loopback disabled, */
    /* this bit has no meaning but clear anyway */
    /* to set it back to default value */
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_RSRC_SHIFT) = (uint32_t)0U;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetSingleWireCmd
 * Description   : Configures the LPUART single-wire operation (enable/disable
 *                 single-wire mode)
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetSingleWireCmd(LPUART_Type * base, bool enable)
{
    /* to enable single-wire mode, need both LOOPS and RSRC set,
     * to enable or clear both */
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_LOOPS_SHIFT) = (uint32_t)enable;
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_RSRC_SHIFT) = (uint32_t)enable;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetReceiverInStandbyMode
 * Description   : Places the LPUART receiver in standby mode.
 * In some LPUART instances, before placing LPUART in standby mode, first
 * determine whether the receiver is set to wake on idle or whether it is
 * already in idle state.
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_SetReceiverInStandbyMode(LPUART_Type * base)
{
    lpuart_wakeup_method_t rxWakeMethod;
    bool lpuart_current_rx_state;

    rxWakeMethod = LPUART_HAL_GetReceiverWakeupMode(base);
    lpuart_current_rx_state = LPUART_HAL_GetStatusFlag(base, LPUART_RX_ACTIVE);

    /* if both rxWakeMethod is set for idle and current rx state is idle,
     * don't put in standby */
    if ((rxWakeMethod == LPUART_IDLE_LINE_WAKE) && (lpuart_current_rx_state == 0))
    {
        return LPUART_STAT_RX_STAND_BY_MODE_ERROR;
    }
    else
    {
        /* set the RWU bit to place receiver into standby mode */
        BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_RWU_SHIFT) = (uint32_t)1U;
        return LPUART_STAT_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetIdleLineDetect
 * Description   : LPUART idle-line detect operation configuration (idle line
 * bit-count start and wake up affect on IDLE status bit).
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetIdleLineDetect(LPUART_Type * base,
                                  const lpuart_idle_line_config_t *config)
{
    /* Configure the idle line detection configuration as follows:
     * configure the ILT to bit count after start bit or stop bit
     * configure RWUID to set or not set IDLE status bit upon detection of
     * an idle character when receiver in standby */
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_ILT_SHIFT) = (uint32_t)config->idleLineType;
    BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_RWUID_SHIFT) = (uint32_t)config->rxWakeIdleDetect;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetMatchAddressReg1
 * Description   : Configures match address register 1
 *
 *END**************************************************************************/
void LPUART_HAL_SetMatchAddressReg1(LPUART_Type * base, bool enable, uint8_t value)
{
    uint32_t matchRegValTemp;

