arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/lpuart/fsl_lpuart_hal.c
    /* The MAEN bit must be cleared before configuring MA value */
    BITBAND_ACCESS32(&(base->BAUD), LPUART_BAUD_MAEN1_SHIFT) = (uint32_t)0U;
    if (enable)
    {
        matchRegValTemp = base->MATCH;
        matchRegValTemp &= ~(LPUART_MATCH_MA1_MASK);
        matchRegValTemp |= LPUART_MATCH_MA1(value);
        base->MATCH = matchRegValTemp;

        BITBAND_ACCESS32(&(base->BAUD), LPUART_BAUD_MAEN1_SHIFT) = (uint32_t)1U;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetMatchAddressReg2
 * Description   : Configures match address register 2
 *
 *END**************************************************************************/
void LPUART_HAL_SetMatchAddressReg2(LPUART_Type * base, bool enable, uint8_t value)
{
    uint32_t matchRegValTemp;

    /* The MAEN bit must be cleared before configuring MA value */
    BITBAND_ACCESS32(&(base->BAUD), LPUART_BAUD_MAEN2_SHIFT) = (uint32_t)0U;
    if (enable)
    {
        matchRegValTemp = base->MATCH;
        matchRegValTemp &= ~(LPUART_MATCH_MA2_MASK);
        matchRegValTemp |= LPUART_MATCH_MA2(value);
        base->MATCH = matchRegValTemp;

        BITBAND_ACCESS32(&(base->BAUD), LPUART_BAUD_MAEN2_SHIFT) = (uint32_t)1U;
    }
}

#if FSL_FEATURE_LPUART_HAS_IR_SUPPORT
/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_SetInfrared
 * Description   : Configures the LPUART infrared operation.
 *
 *END**************************************************************************/
void LPUART_HAL_SetInfrared(LPUART_Type * base, bool enable,
                            lpuart_ir_tx_pulsewidth_t pulseWidth)
{
    uint32_t modirRegValTemp;

    /* enable or disable infrared */
    BITBAND_ACCESS32(&(base->MODIR), LPUART_MODIR_IREN_SHIFT) = (uint32_t)enable;

    /* configure the narrow pulse width of the IR pulse */
    modirRegValTemp = base->MODIR;
    modirRegValTemp &= ~(LPUART_MODIR_TNP_MASK);
    modirRegValTemp |= LPUART_MODIR_TNP(pulseWidth);
    base->MODIR = modirRegValTemp;
}
#endif  /* FSL_FEATURE_LPUART_HAS_IR_SUPPORT */

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_GetStatusFlag
 * Description   : LPUART get status flag by passing flag enum.
 *
 *END**************************************************************************/
bool LPUART_HAL_GetStatusFlag(LPUART_Type * base, lpuart_status_flag_t statusFlag)
{
    uint32_t reg = (uint32_t)(statusFlag) >> LPUART_SHIFT;
    bool retVal = false;

    switch ( reg )
    {
        case LPUART_BAUD_REG_ID:
            retVal = (bool)(base->BAUD >> (uint32_t)(statusFlag) & 1U);
            break;
        case LPUART_STAT_REG_ID:
            retVal = (bool)(base->STAT >> (uint32_t)(statusFlag) & 1U);
            break;
        case LPUART_CTRL_REG_ID:
            retVal = (bool)(base->CTRL >> (uint32_t)(statusFlag) & 1U);
            break;
        case LPUART_DATA_REG_ID:
            retVal = (bool)(base->DATA >> (uint32_t)(statusFlag) & 1U);
            break;
        case LPUART_MATCH_REG_ID:
            retVal = (bool)(base->MATCH >> (uint32_t)(statusFlag) & 1U);
            break;
#if FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
        case LPUART_MODIR_REG_ID:
            retVal = (bool)(base->MODIR >> (uint32_t)(statusFlag) & 1U);
            break;
#endif
        default:
            break;
    }

    return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPUART_HAL_ClearStatusFlag
 * Description   : LPUART clears an individual status flag
 * (see lpuart_status_flag_t for list of status bits).
 *
 *END**************************************************************************/
lpuart_status_t LPUART_HAL_ClearStatusFlag(LPUART_Type * base,
                                           lpuart_status_flag_t statusFlag)
{
    lpuart_status_t returnCode = LPUART_STAT_SUCCESS;

    switch(statusFlag)
    {
        /* These flags are cleared automatically by other lpuart operations
         * and cannot be manually cleared, return error code */
        case LPUART_TX_DATA_REG_EMPTY:
        case LPUART_TX_COMPLETE:
        case LPUART_RX_DATA_REG_FULL:
        case LPUART_RX_ACTIVE:
#if FSL_FEATURE_LPUART_HAS_EXTENDED_DATA_REGISTER_FLAGS
        case LPUART_NOISE_IN_CURRENT_WORD:
        case LPUART_PARITY_ERR_IN_CURRENT_WORD:
#endif
            returnCode = LPUART_STAT_CLEAR_STATUS_FLAG_ERROR;
            break;

        case LPUART_IDLE_LINE_DETECT:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_IDLE_SHIFT) = (uint32_t)1U;
            break;

        case LPUART_RX_OVERRUN:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_OR_SHIFT) = (uint32_t)1U;
            break;

        case LPUART_NOISE_DETECT:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_NF_SHIFT) = (uint32_t)1U;
            break;

        case LPUART_FRAME_ERR:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_FE_SHIFT) = (uint32_t)1U;
            break;

        case LPUART_PARITY_ERR:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_PF_SHIFT) = (uint32_t)1U;
            break;

        case LPUART_LIN_BREAK_DETECT:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_LBKDIF_SHIFT) = (uint32_t)1U;
            break;

        case LPUART_RX_ACTIVE_EDGE_DETECT:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_RXEDGIF_SHIFT) = (uint32_t)1U;
            break;

#if FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
        case LPUART_MATCH_ADDR_ONE:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_MA1F_SHIFT) = (uint32_t)1U;
            break;
        case LPUART_MATCH_ADDR_TWO:
            BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_MA2F_SHIFT) = (uint32_t)1U;
            break;
#endif
#if FSL_FEATURE_LPUART_FIFO_SIZE
        case LPUART_FIFO_TX_OF:
            BITBAND_ACCESS32(&(base->FIFO), LPUART_FIFO_TXOF_SHIFT) = (uint32_t)1U;
            break;
        case LPUART_FIFO_RX_UF:
            BITBAND_ACCESS32(&(base->FIFO), LPUART_FIFO_RXUF_SHIFT) = (uint32_t)1U;
            break;
#endif
        default:
            returnCode = LPUART_STAT_CLEAR_STATUS_FLAG_ERROR;
            break;
    }

    return (returnCode);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

